marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcu_TS_T40D2M10I1R0/include/Reg_eSys_SCG.h
/**
*   @file    Reg_eSys_SCG.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Mcu - Macros for memory access.
*   @details Macros/Defines used for registry and memory read/write.
*
*   @addtogroup MCU
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : MC
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_HF1_ASR_REL_4_2_REV_0002_20180723
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


#ifndef REG_ESYS_SCG_H
#define REG_ESYS_SCG_H


#ifdef __cplusplus
extern "C"{
#endif


/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_SCG_h_REF_1
* Violates MISRA 2004 Required Rule 1.4, : The compiler/linker shall be checked to ensure that 31
* character significance and case sensitivity are supported for external identifiers
*
* @section Reg_eSys_SCG_h_REF_2
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*/


/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define REG_ESYS_SCG_VENDOR_ID                       43
#define REG_ESYS_SCG_AR_RELEASE_MAJOR_VERSION        4
#define REG_ESYS_SCG_AR_RELEASE_MINOR_VERSION        2
#define REG_ESYS_SCG_AR_RELEASE_REVISION_VERSION     2
#define REG_ESYS_SCG_SW_MAJOR_VERSION                1
#define REG_ESYS_SCG_SW_MINOR_VERSION                0
#define REG_ESYS_SCG_SW_PATCH_VERSION                1


/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_SCG_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_SCG_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_SCG.h and Reg_eSys.h are different"
    #endif
#endif

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/


/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/
/********** SCG Registers **********/

/* SCG_VERID - Version ID Register */
#define SCG_VERID_ADDR32                    ((uint32)(SCG_BASEADDR + (uint32)0x00000000U))
/* SCG_PARAM - Parameter Register */
#define SCG_PARAM_ADDR32                    ((uint32)(SCG_BASEADDR + (uint32)0x00000004U))
/* SCG_CSR - Clock Status Register */
#define SCG_CSR_ADDR32                      ((uint32)(SCG_BASEADDR + (uint32)0x00000010U))
/* SCG_RCCR - Run Clock Control Register */
#define SCG_RCCR_ADDR32                     ((uint32)(SCG_BASEADDR + (uint32)0x00000014U))
/* SCG_VCCR - VLPR Clock Control Register */
#define SCG_VCCR_ADDR32                     ((uint32)(SCG_BASEADDR + (uint32)0x00000018U))
/* SCG_HCCR - HSRUN Clock Control Register */
#define SCG_HCCR_ADDR32                     ((uint32)(SCG_BASEADDR + (uint32)0x0000001CU))
/* SCG_CLKOUTCNFG - SCG CLKOUT Configuration Register */
#define SCG_CLKOUTCNFG_ADDR32               ((uint32)(SCG_BASEADDR + (uint32)0x00000020U))
/* SCG_SOSCCSR - System OSC Control Status Register */
#define SCG_SOSCCSR_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000100U))
/* SCG_SOSCDIV - System OSC Divide Register */
#define SCG_SOSCDIV_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000104U))
/* SCG_SOSCCFG - System Oscillator Configuration Register */
#define SCG_SOSCCFG_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000108U))
/* SCG_SIRCCSR - Slow IRC Control Status Register */
#define SCG_SIRCCSR_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000200U))
/* SCG_SIRCDIV - Slow IRC Divide Register */
#define SCG_SIRCDIV_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000204U))
/* SCG_SIRCCFG - Slow IRC Configuration Register */
#define SCG_SIRCCFG_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000208U))
/* SCG_FIRCCSR - Fast IRC Control Status Register */
#define SCG_FIRCCSR_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000300U))
/* SCG_FIRCDIV - Fast IRC Divide Register */
#define SCG_FIRCDIV_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000304U))
/* SCG_FIRCCFG - Fast IRC Configuration Register */
#define SCG_FIRCCFG_ADDR32                  ((uint32)(SCG_BASEADDR + (uint32)0x00000308U))
/* SCG_FIRCTCFG - Fast IRC Trim Configuration Register */
#define SCG_FIRCTCFG_ADDR32                 ((uint32)(SCG_BASEADDR + (uint32)0x0000030CU))
/* SCG_FIRCSTAT - Fast IRC Status Register */
#define SCG_FIRCSTAT_ADDR32                 ((uint32)(SCG_BASEADDR + (uint32)0x00000318U))
/* SCG_SPLLCSR - System PLL Control Status Register */
#define SCG_SPLLCSR_ADDR32                 ((uint32)(SCG_BASEADDR + (uint32)0x00000600U))
/* SCG_SPLLDIV - System PLL Divide Register */
#define SCG_SPLLDIV_ADDR32                 ((uint32)(SCG_BASEADDR + (uint32)0x00000604U))
/* SCG_SPLLCFG - System PLL Configuration Register */
#define SCG_SPLLCFG_ADDR32                 ((uint32)(SCG_BASEADDR + (uint32)0x00000608U))


