marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcu_TS_T40D2M10I1R0/include/Reg_eSys_SCG.h
#define SCG_SOSCCSR_SOSCCMRE_ISR_U32            ((uint32)0x00000000U)
#define SCG_SOSCCSR_SOSCCMRE_RESET_U32          (SCG_SOSCCSR_SOSCCMRE_MASK32)

#define SCG_SOSCCSR_SOSCCM_DIS_U32              ((uint32)0x00000000U)
#define SCG_SOSCCSR_SOSCCM_ENA_U32              (SCG_SOSCCSR_SOSCCM_MASK32)

#define SCG_SOSCCSR_SOSCERCLKEN_ERCLK_DIS_U32   ((uint32)0x00000000U)
#define SCG_SOSCCSR_SOSCERCLKEN_ERCLK_ENA_U32   (SCG_SOSCCSR_SOSCERCLKEN_MASK32)

#define SCG_SOSCCSR_SOSC_DISABLE_U32            ((uint32)0x00000000U)
#define SCG_SOSCCSR_SOSC_ENABLE_U32             (SCG_SOSCCSR_SOSCEN_MASK32)

/****************************************************/
/***              SCG_SOSCDIV                     ***/
/****************************************************/
#define SCG_SOSCDIV_RWBITS_MASK32               ((uint32)0x00000707U)

#define SCG_SOSCDIV_SOSCDIV2_MASK32             ((uint32)0x00000700U)
#define SCG_SOSCDIV_SOSCDIV2_SHIFT32            ((uint32)8U)
#define SCG_SOSCDIV_SOSCDIV1_MASK32             ((uint32)0x00000007U)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SOSCDIV_SOSCDIV2_U32(value)           ((uint32)((uint32)((value) << SCG_SOSCDIV_SOSCDIV2_SHIFT32) & SCG_SOSCDIV_SOSCDIV2_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SOSCDIV_SOSCDIV1_U32(value)          (((value) & SCG_SOSCDIV_SOSCDIV1_MASK32))

/****************************************************/
/***              SCG_SOSCCFG                     ***/
/****************************************************/
#define SCG_SOSCCFG_RWBITS_MASK32               ((uint32)0x0000003CU)

#define SCG_SOSCCFG_RANGE_MASK32                ((uint32)0x00000030U)
#define SCG_SOSCCFG_HG0_MASK32                  ((uint32)0x00000008U)
#define SCG_SOSCCFG_EREFS_MASK32                ((uint32)0x00000004U)
#define SCG_SOSCCSR_SOSCEN_MASK32                   ((uint32)0x00000001U)

#define SCG_SOSCCFG_LOW_FREQ_RANGE_U32          ((uint32)0x00000010U)
#define SCG_SOSCCFG_MEDIUM_FREQ_RANGE_U32       ((uint32)0x00000020U)
#define SCG_SOSCCFG_HIGH_FREQ_RANGE_U32         (SCG_SOSCCFG_RANGE_MASK32)

#define SCG_SOSCCFG_LOW_POWER_OPERATION_U32     ((uint32)0x00000000U)
#define SCG_SOSCCFG_HIGH_GAIN_OPERATION_U32     (SCG_SOSCCFG_HG0_MASK32)

#define SCG_SOSCCFG_EXTERNAL_REFERENCE_U32      ((uint32)0x00000000U)
#define SCG_SOSCCFG_INTERNAL_OSCILLATOR_U32     (SCG_SOSCCFG_EREFS_MASK32)

#define SCG_SOSCCSR_SOSC_DISABLE_U32            ((uint32)0x00000000U)
#define SCG_SOSCCSR_SOSC_ENABLE_U32             (SCG_SOSCCSR_SOSCEN_MASK32)

/****************************************************/
/***              SCG_SIRCCSR                     ***/
/****************************************************/
#define SCG_SIRCCSR_RWBITS_MASK32               ((uint32)0x00800007U)
#define SCG_SIRCCSR_RESBITS_MASK32              ((uint32)0x03000000U)

#define SCG_SIRCCSR_LK_MASK32                   ((uint32)0x00800000U)
#define SCG_SIRCCSR_SIRCLPEN_MASK32             ((uint32)0x00000004U)
#define SCG_SIRCCSR_SIRCSTEN_MASK32             ((uint32)0x00000002U)
#define SCG_SIRCCSR_SIRCEN_MASK32               ((uint32)0x00000001U)

#define SCG_SIRCCSR_SIRCVLD_MASK32              ((uint32)0x01000000U)

#define SCG_SIRCCSR_LK_UNLOCK_U32               ((uint32)0x00000000U) 
#define SCG_SIRCCSR_LK_LOCK_U32                 (SCG_SIRCCSR_LK_MASK32)

#define SCG_SIRCCSR_SIRCLPEN_VLP_DIS_U32        ((uint32)0x00000000U)
#define SCG_SIRCCSR_SIRCLPEN_VLP_ENA_U32        (SCG_SIRCCSR_SIRCLPEN_MASK32)

#define SCG_SIRCCSR_SIRCSTEN_STOP_DIS_U32       ((uint32)0x00000000U)
#define SCG_SIRCCSR_SIRCSTEN_STOP_ENA_U32       (SCG_SIRCCSR_SIRCSTEN_MASK32)

#define SCG_SIRCCSR_SIRC_DISABLE_U32            ((uint32)0x00000000U)
#define SCG_SIRCCSR_SIRC_ENABLE_U32             (SCG_SIRCCSR_SIRCEN_MASK32)

/****************************************************/
/***             SCG_SIRCDIV                      ***/
/****************************************************/
#define SCG_SIRCDIV_RWBITS_MASK32               ((uint32)0x00000707U)

#define SCG_SIRCDIV_SIRCDIV2_MASK32             ((uint32)0x00000700U)
#define SCG_SIRCDIV_SIRCDIV2_SHIFT32            ((uint32)8U)
#define SCG_SIRCDIV_SIRCDIV1_MASK32             ((uint32)0x00000007U)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SIRCDIV_SIRCDIV2_U32(value)           ((uint32)((uint32)((uint32)(value) << SCG_SIRCDIV_SIRCDIV2_SHIFT32) & SCG_SIRCDIV_SIRCDIV2_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SIRCDIV_SIRCDIV1_U32(value)          (((uint32)(value) & SCG_SIRCDIV_SIRCDIV1_MASK32))

/****************************************************/
/***         SCG_SIRCCFG                          ***/
/****************************************************/
#define SCG_SIRCCFG_RWBITS_MASK32                   ((uint32)0x00000001U)

#define SCG_SIRCCFG_RANGE_MASK32                    ((uint32)0x00000001U)

#define SCG_SIRCCFG_LOW_RANGE_CLOCK_U32             ((uint32)0x00000000U)
#define SCG_SIRCCFG_HIGH_RANGE_CLOCK_U32            ((uint32)0x00000001U)

/****************************************************/
/***            SCG_FIRCCSR                       ***/
/****************************************************/
#define SCG_FIRCCSR_RWBITS_MASK32                   ((uint32)0x04800009U)

#define SCG_FIRCCSR_FIRCERR_MASK32                  ((uint32)0x04000000U)
#define SCG_FIRCCSR_LK_MASK32                       ((uint32)0x00800000U)
#define SCG_FIRCCSR_FIRCTRUP_MASK32                 ((uint32)0x00000200U)
#define SCG_FIRCCSR_FIRCTREN_MASK32                 ((uint32)0x00000100U)
#define SCG_FIRCCSR_FIRCREGOFF_MASK32               ((uint32)0x00000008U)
#define SCG_FIRCCSR_FIRCEN_MASK32                   ((uint32)0x00000001U)

#define SCG_FIRCCSR_FIRCVLD_MASK32                  ((uint32)0x01000000U)

#define SCG_FIRCCSR_LK_UNLOCK_U32                   ((uint32)0x00000000U)
#define SCG_FIRCCSR_LK_LOCK_U32                     (SCG_FIRCCSR_LK_MASK32)

#define SCG_FIRCCSR_FIRCTRUP_DIS_U32                ((uint32)0x00000000U)
#define SCG_FIRCCSR_FIRCTRUP_ENA_U32                (SCG_FIRCCSR_FIRCTRUP_MASK32)

#define SCG_FIRCCSR_FIRCTREN_DIS_U32                ((uint32)0x00000000U)
#define SCG_FIRCCSR_FIRCTREN_ENA_U32                (SCG_FIRCCSR_FIRCTREN_MASK32)

#define SCG_FIRCCSR_REGULATOR_ENABLE_U32            ((uint32)0x00000000U)
#define SCG_FIRCCSR_REGULATOR_DISABLE_U32           (SCG_FIRCCSR_FIRCREGOFF_MASK32)

