marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcu_TS_T40D2M10I1R0/include/Reg_eSys_SCG.h
#define SCG_FIRCCSR_FIRC_DISABLE_U32                ((uint32)0x00000000U)
#define SCG_FIRCCSR_FIRC_ENABLE_U32                 (SCG_FIRCCSR_FIRCEN_MASK32)

#define SCG_FIRCCSR_CONFIG_REG                      (2U)

/****************************************************/
/***          SCG_FIRCDIV                         ***/
/****************************************************/
#define SCG_FIRCDIV_RWBITS_MASK32               ((uint32)0x00000707U)

#define SCG_FIRCDIV_FIRCDIV2_MASK32             ((uint32)0x00000700U)
#define SCG_FIRCDIV_FIRCDIV2_SHIFT32            ((uint32)8U)
#define SCG_FIRCDIV_FIRCDIV1_MASK32             ((uint32)0x00000007U)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_FIRCDIV_FIRCDIV2_U32(value)           ((uint32)((uint32)((uint32)(value) << SCG_FIRCDIV_FIRCDIV2_SHIFT32) & SCG_FIRCDIV_FIRCDIV2_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_FIRCDIV_FIRCDIV1_U32(value)          (((uint32)(value) & SCG_FIRCDIV_FIRCDIV1_MASK32))

/****************************************************/
/***                   SCG_FIRCCFG                ***/
/****************************************************/
#define SCG_FIRCCFG_RWBITS_MASK32                 ((uint32)0x00000003U)

#define SCG_FIRCCFG_RANGE_MASK32                  ((uint32)0x00000003U)

#define SCG_FIRCCFG_48MHZ_U32                 ((uint32)0x00000000U)
#define SCG_FIRCCFG_52MHZ_U32                 ((uint32)0x00000001U)
#define SCG_FIRCCFG_56MHZ_U32                 ((uint32)0x00000002U)
#define SCG_FIRCCFG_60MHZ_U32                 ((uint32)0x00000003U)

/****************************************************/
/***                   SCG_FIRCTCFG               ***/
/****************************************************/
#define SCG_FIRCTCFG_RWBITS_MASK32                 ((uint32)0x00000073U)

#define SCG_FIRCTCFG_TRIMDIV_MASK32                ((uint32)0x00000070U)
#define SCG_FIRCTCFG_TRIMSRC_MASK32                ((uint32)0x00000003U)
/** @violates @ref Reg_eSys_SCG_h_REF_1 MISRA 2004 Required Rule 1.4*/
#define SCG_FIRCTCFG_TRIMDIV_DIVIDE_BY_1_U32       ((uint32)0x00000000U)
/** @violates @ref Reg_eSys_SCG_h_REF_1 MISRA 2004 Required Rule 1.4*/
#define SCG_FIRCTCFG_TRIMDIV_DIVIDE_BY_128_U32     ((uint32)0x00000100U)
/** @violates @ref Reg_eSys_SCG_h_REF_1 MISRA 2004 Required Rule 1.4*/
#define SCG_FIRCTCFG_TRIMDIV_DIVIDE_BY_256_U32     ((uint32)0x00000200U)
/** @violates @ref Reg_eSys_SCG_h_REF_1 MISRA 2004 Required Rule 1.4*/
#define SCG_FIRCTCFG_TRIMDIV_DIVIDE_BY_512_U32     ((uint32)0x00000300U)
/** @violates @ref Reg_eSys_SCG_h_REF_1 MISRA 2004 Required Rule 1.4*/
#define SCG_FIRCTCFG_TRIMDIV_DIVIDE_BY_1024_U32    ((uint32)0x00000400U)
/** @violates @ref Reg_eSys_SCG_h_REF_1 MISRA 2004 Required Rule 1.4*/
#define SCG_FIRCTCFG_TRIMDIV_DIVIDE_BY_2048_U32    ((uint32)0x00000500U)

#define SCG_FIRCTCFG_TRIMSRC_SOSC_U32              ((uint32)0x00000002U)

/****************************************************/
/***                   SCG_FIRCSTAT               ***/
/****************************************************/
#define SCG_FIRCSTAT_RWBITS_MASK32                 ((uint32)0x00003F7FU)

#define SCG_FIRCSTAT_TRIMCOAR_MASK32               ((uint32)0x00003F00U)
#define SCG_FIRCSTAT_TRIMCOAR_SHIFT32              ((uint32)8U)
#define SCG_FIRCSTAT_TRIMFINE_MASK32               ((uint32)0x0000007FU)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_FIRCSTAT_TRIMCOAR_U32(value)          ((uint32)((uint32)((value) << SCG_FIRCSTAT_TRIMCOAR_SHIFT32) & SCG_FIRCSTAT_TRIMCOAR_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_FIRCSTAT_TRIMFINE_U32(value)          (((value) & SCG_FIRCSTAT_TRIMFINE_MASK32))

/****************************************************/
/***              SCG_SPLLCSR                     ***/
/****************************************************/
#define SCG_SPLLCSR_RWBITS_MASK32               ((uint32)0x04830001U)

#define SCG_SPLLCSR_SPLLERR_MASK32              ((uint32)0x04000000U)
#define SCG_SPLLCSR_SPLLVLD_MASK32              ((uint32)0x01000000U)
#define SCG_SPLLCSR_LK_MASK32                   ((uint32)0x00800000U)
#define SCG_SPLLCSR_SPLLCMRE_MASK32             ((uint32)0x00020000U)
#define SCG_SPLLCSR_SPLLCM_MASK32               ((uint32)0x00010000U)
#define SCG_SPLLCSR_SPLLEN_MASK32               ((uint32)0x00000001U)

#define SCG_SPLLCSR_LK_UNLOCK_U32               ((uint32)0x00000000U) 
#define SCG_SPLLCSR_LK_LOCK_U32                 (SCG_SPLLCSR_LK_MASK32)

#define SCG_SPLLCSR_SPLLCMRE_ISR_U32            ((uint32)0x00000000U)
#define SCG_SPLLCSR_SPLLCMRE_RESET_U32          (SCG_SPLLCSR_SPLLCMRE_MASK32)

#define SCG_SPLLCSR_SPLLCM_DIS_U32              ((uint32)0x00000000U)
#define SCG_SPLLCSR_SPLLCM_ENA_U32              (SCG_SPLLCSR_SPLLCM_MASK32)

#define SCG_SPLLCSR_SPLL_DISABLE_U32            ((uint32)0x00000000U)
#define SCG_SPLLCSR_SPLL_ENABLE_U32             (SCG_SPLLCSR_SPLLEN_MASK32)

/****************************************************/
/***             SCG_SPLLDIV                      ***/
/****************************************************/
#define SCG_SPLLDIV_RWBITS_MASK32               ((uint32)0x00000707U)

#define SCG_SPLLDIV_SPLLDIV2_MASK32             ((uint32)0x00000700U)
#define SCG_SPLLDIV_SPLLDIV2_SHIFT32            ((uint32)8U)
#define SCG_SPLLDIV_SPLLDIV1_MASK32             ((uint32)0x00000007U)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SPLLDIV_SPLLDIV2_U32(value)           ((uint32)((uint32)((value) << SCG_SPLLDIV_SPLLDIV2_SHIFT32) & SCG_SPLLDIV_SPLLDIV2_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SPLLDIV_SPLLDIV1_U32(value)          (((value) & SCG_SPLLDIV_SPLLDIV1_MASK32))

